// 预处理
#include<stdio.h>

/*

1.程序执行流程： 编写-》编译-》链接-》运行
2.//单行注释  （多行注释是大外框)  提高代码可读性   ctrl+shift+/ 最好不嵌套
3.关键字都是小写且颜色特殊标记。

4.常量： 整型123；实型1.93 1.70；字符型（不为空）'A' 'B' ；字符串常量"NIDIE" "你爹"
		补充：实型：.93=0.93   18.=18.0
			 科学计数法是实型常量（写E） ：1.23E8

5.输出常量｛占位符｝：字符串：printf("字符串常量"); 整型：printf("%d",123); 
			实型：printf("%f",1.93);字符：zprintf("%c",'A');

6.







*/



//------------------------------------------------------------------------
/*
//程序入口
int main()
{
	printf("我是你爹");
	//程序的结果 0为正常停止 非0异常停止
	return 0;
}*/




//程序入口
int main()
{
/*			//占位符展示
	//输出整数
	printf("%d",15);
	//输出小数
	printf("%f", 18.0);
	//输出字符
	printf("%c", 'A');
	//输出字符串
	printf("这是字符串串");
	printf("我名字是%s", "你爹");
	*/

	/*
	//练习1：打印学校名字
	printf("我的大专学校名字是:%s，\n本科学校名字是:%s", "贵州电子科技职业学院","贵州黔南科技学院");


	//练习2：打印高考成绩
	printf("我的高考成绩是:%f分", 666.6);


	//练习3：我亲亲女朋友的姓名是:小诗诗。性别:女。年龄:18岁。身高:1米82。体重:110斤。
	// 要求:女朋友的姓名，性别，年龄，身高，体重等信息需要结合占位符的形式进行输出
	printf("我亲亲女朋友的姓名是:%s。性别%s:。年龄%d:。身高%f:。体重%d:。","小诗诗","女",18,1.82,110);


	//练习4：
	//我亲亲女朋友的姓名是:小丹丹。性别:女。年龄:19岁。身高 : 1米63。体重 : 90斤。
	// 要求1 : 女朋友的姓名，性别，年龄，身高，体重等信息需要结合占位符的形式进行输出
	// 要求2 : 每一个数据单独成一行
	printf("我亲亲女朋友的姓名是:%s\n性别:%s\n年龄:%d\n身高 : %f\n体重 : %d斤\n","小丹丹","女",18,1.63,90);
	*/

	//程序的结果 0为正常停止 非0异常停止
	return 0;
}





 
